{"Articles":[
    {
        "_id": 1,
        "date": "5-15-2022", 
        "category": "Politics", 
        "viewed": "38596",
        "title": "Joe Biden Announces New Infrastructure Plan", 
        "description": "President Joe Biden announced a new $2 trillion infrastructure plan on Monday, aimed at creating jobs and modernizing the country's infrastructure.", 
        "content": "President Joe Biden unveiled a sweeping new $2 trillion infrastructure plan on Monday, aimed at upgrading and modernizing the nation's roads, bridges, airports, and broadband infrastructure.", 
        "author": "1"},
    {
        "_id": 2,
        "date": "6-20-2022",
        "category": "Sport",
        "viewed": "7186",
        "title": "England Wins Euro 2022 Championship",
        "description": "England defeats Italy in the final to win the Euro 2022 Championship.",
        "content": "England has won the Euro 2022 Championship after defeating Italy 1-0 in the final. The game was held at Wembley Stadium in London, and was watched by millions of fans around the world. England's victory was sealed by a second-half goal from striker Harry Kane, who was named the tournament's top scorer with six goals. The win marks England's first major international trophy since the 1966 World Cup.",
        "author": "2"},
    {
        "_id": 3,
        "date": "7-12-2022",
        "category": "Science & Technology",
        "viewed": "24187",
        "title": "Huawei Launches New Flagship Smartphone",
        "description": "Huawei unveils the new Mate 50 Pro, featuring cutting-edge technology and advanced camera features.",
        "content": "Huawei has launched its latest flagship smartphone, the Mate 50 Pro. The device features a 6.7-inch OLED display with a resolution of 1440 x 3200 pixels, and is powered by Huawei's Kirin 990 5G processor. The Mate 50 Pro also boasts a quad-camera setup, with a 64-megapixel main camera, a 12-megapixel ultra-wide camera, a 5-megapixel macro camera, and a 3D time-of-flight sensor. The device also includes features such as 8K video recording and 120Hz refresh rate. The Mate 50 Pro is available for pre-order now and will be released later this month.",
        "author": "3"},
    {
        "_id": 4,
        "date": "8-25-2022",
        "category": "Sport",
        "viewed": "8762",
        "title": "Manchester City Wins Premier League title",
        "description": "Manchester City clinches the Premier League title after a dramatic final day of the season.",
        "content": "Manchester City secured the Premier League title on Sunday, in dramatic fashion. The club was tied on points with Liverpool going into the final day of the season, but a 4-0 victory over Aston Villa, combined with a shock defeat for Liverpool, meant that Manchester City finished on top of the table. It is the club's fourth Premier League title in five years, and the victory was celebrated by fans across the city.",
        "author": "4"},
    {
        "_id": 5,
        "date": "11-3-2022",
        "category": "Science & Technology",
        "viewed": "67289",
        "title": "Sony Launches New PlayStation Console",
        "description": "Sony unveils its latest PlayStation console, promising improved graphics and faster loading times.",
        "content": "Sony has launched its latest PlayStation console, the PlayStation 5. The new console boasts significant improvements in graphics and processing power, with faster loading times and more advanced sound capabilities. The console also features a new controller design, with haptic feedback and adaptive triggers for a more immersive gaming experience. The PlayStation 5 has been highly anticipated by gaming fans around the world, and many are already lining up to get their hands on the new console.",
        "author": "5"},
    {
        "_id": 6,
        "date": "6-20-2022",
        "category": "Economy",
        "viewed": "12658",
        "title": "Australian Economy Shows Signs of Recovery",
        "description": "Recent data shows that the Australian economy is rebounding after a difficult year.",
        "content": "The Australian economy is showing signs of recovery, according to recent data from the Australian Bureau of Statistics. The country's gross domestic product (GDP) increased by 1.8% in the first quarter of 2022, marking the fourth consecutive quarter of growth. The mining sector was a key driver of growth, with higher commodity prices boosting exports. The manufacturing and construction sectors also showed improvement. However, some economists caution that the recovery may not be sustained, as the country faces ongoing challenges from the COVID-19 pandemic and global economic uncertainties.",
        "author": "6"},
    {
        "_id": 7,
        "date": "7-1-2022",
        "category": "Science & Technology",
        "viewed": "35456",
        "title": "Facebook Announces New AI-Powered Feature to Detect Fake News",
        "description": "Facebook has announced a new feature that uses artificial intelligence to detect and flag potentially misleading or false news articles.",
        "content": "Facebook has announced a new AI-powered feature that will help the platform to detect and flag potentially ",
        "author": "7"},
    {
        "_id": 8,
        "date": "9-10-2022",
        "category": "Sport",
        "viewed": "13584",
        "title": "Naomi Osaka Wins US Open Women's Singles title",
        "description": "Japanese tennis star Naomi Osaka won her fourth Grand Slam title at the US Open Women's Singles final on ",
        "content": "Japanese tennis star Naomi Osaka won her fourth Grand Slam title at the US Open Women's Singles final on ",
        "author": "8"},
    {
        "_id": 9,
        "date": "9-5-2022",
        "category": "Medical",
        "viewed": "37982",
        "title": "New Study Shows Benefits of Meditation for Mental Health",
        "description": "A new study published in a leading medical journal suggests that meditation can have significant positive effects on mental health.",
        "content": "A new study published in the Journal of the American Medical Association has found that regular meditation practice can have significant positive effects on mental health. The study, which involved a large sample of adults with a history of anxiety and depression, found that those who meditated regularly experienced a significant reduction in symptoms compared to those who did not meditate. The researchers suggest that meditation may be an effective tool for managing symptoms of anxiety and depression, and may offer a safe and cost-effective alternative to traditional forms of therapy.",
        "author": "9"},
    {
        "_id": 10,
        "date": "9-10-2022",
        "category": "Sport",
        "viewed": "26846",
        "title": "Naomi Osaka Wins US Open Tennis Tournament",
        "description": "Naomi Osaka won her fourth Grand Slam title on Saturday, defeating Leylah Fernandez in a thrilling final at the US Open.",
        "content": "Japanese tennis star Naomi Osaka won her fourth Grand Slam title on Saturday, defeating Canadian teenager Leylah Fernandez in a thrilling final at the US Open. The match was closely contested, with both players displaying incredible skill and athleticism, but Osaka ultimately prevailed in two sets, winning 6-4, 6-3. Osaka has become one of the most successful tennis players of her generation, and is widely regarded as a role model for young athletes around the world.",
        "author": "8"},
    {
        "_id": 11,
        "date": "9-10-2022",
        "category": "Traffic",
        "viewed": "42861",
        "title": "Los Angeles Implements New Traffic Control Measures",
        "description": "The city of Los Angeles has implemented new measures to control traffic and reduce congestion in busy areas.",
        "content": "The city of Los Angeles has announced new measures to control traffic and reduce congestion in busy areas. The measures include a new system of traffic signals that use artificial intelligence to adjust to changing traffic conditions, as well as new dedicated bike lanes and pedestrian crossings. The aim of the measures is to improve safety for all road users and to reduce the time drivers spend stuck in traffic. The new measures have been welcomed by many residents and transportation experts, who hope that they will help to make the city's streets more efficient and enjoyable to use.",
        "author": "11"},
    {
        "_id": 12,
        "date": "6-30-2022",
        "category": "Travel",
        "viewed": "35896",
        "title": "Paris Named World's Best City for Tourists",
        "description": "Paris has been named the world's best city for tourists, according to a new survey by a leading travel magazine.",
        "content": "Paris has been named the world's best city for tourists, according to a new survey by Travel & Leisure magazine. The French capital beat out competition from other popular destinations such as Tokyo, New York, and London to take the top spot. The survey, which polled over 100,000 readers, praised Paris for its cultural attractions, world-renowned cuisine, and romantic atmosphere. The city has also been recognized for its efforts to promote sustainable tourism and reduce its environmental impact.",
        "author": "12"},
    {
        "_id": 13,
        "date": "11-1-2022",
        "category": "Medical",
        "viewed": "97156",
        "title": "Australia Approves New COVID-19 Vaccine for Children",
        "description": "The Therapeutic Goods Administration has approved a new COVID-19 vaccine for children aged 5-11 in Australia.",
        "content": "The Therapeutic Goods Administration (TGA) has approved a new COVID-19 vaccine for use in children aged 5-11 in Australia. The vaccine, developed by Pfizer, has been shown to be safe and effective in clinical trials, and is expected to provide an additional layer of protection against the virus for younger Australians. The rollout of the vaccine is expected to begin in the coming weeks, with priority given to high-risk groups and those in remote and regional areas.",
        "author": "9"},
    {
        "_id": 14,
        "date": "4-1-2023",
        "category": "Travel",
        "viewed": "34954",
        "title": "Musée d'Orsay Welcomes Record Number of Visitors",
        "description": "The Musée d'Orsay in Paris has announced that it has welcomed a record number of visitors this year, following the reopening of its doors after a period of closure due to the COVID-19 pandemic. ",
        "content": "The Musée d'Orsay, one of the most popular art museums in Paris, has announced that it has welcomed a record number of visitors this year, following the reopening of its doors after a period of closure due to the COVID-19 pandemic. The museum, which is housed in a historic train station and features an extensive collection of impressionist and post-impressionist art, attracted over 2 million visitors in the first quarter of 2023. The museum has implemented several safety measures to ensure the health and well-being of visitors, including mandatory mask-wearing and social distancing guidelines.",
        "author": "12"},
    {
        "_id": 15,
        "date": "11-15-2022",
        "category": "Politics",
        "viewed": "29764",
        "title": "French President Emmanuel Macron Visits Germany for Bilateral Talks",
        "description": "French President Emmanuel Macron has traveled to Germany for bilateral talks with German Chancellor Angela Merkel.",
        "content": "French President Emmanuel Macron has traveled to Germany for bilateral talks with German Chancellor Angela Merkel. The two leaders discussed a range of issues, including economic cooperation, climate change, and security. Macron praised Merkel's leadership on the world stage and reaffirmed the importance of the Franco-German partnership in driving forward progress in Europe. The visit comes amid growing tensions between France and the United Kingdom over Brexit, and Macron is expected to discuss the issue with Merkel as part of their talks.",
        "author": "13"},
    {
        "_id": 16,
        "date": "5-20-2023",
        "category": "Medical",
        "viewed": "34876",
        "title": "New Study Finds Link Between Sleep Deprivation and Increased Risk of Chronic Illness",
        "description": "A new study has found that people who consistently get less than 7 hours of sleep per night may be at an increased risk for chronic illnesses such as diabetes, heart disease, and depression.",
        "content": "A new study has shed light on the importance of getting enough sleep for overall health. The study found that individuals who consistently get less than 7 hours of sleep per night may be at an increased risk for chronic illnesses such as diabetes, heart disease, and depression. The study also found that the risk of developing these conditions increased with each additional hour of sleep lost. The findings underscore the importance of prioritizing sleep as part of a healthy lifestyle.",
        "author": "10"},
    {
        "_id": 17,
        "date": "4-1-2023",
        "category": "Politics",
        "viewed": "26579",
        "title": "President Macron announces new measures to combat climate change ",
        "description": "President Emmanuel Macron has announced a series of new measures aimed at reducing France's carbon emissions and combating climate change.",
        "content": "President Emmanuel Macron has announced a series of new measures aimed at reducing France's carbon emissions and combating climate change. The measures include a ban on the sale of new gasoline and diesel cars by 2030, an increase in the price of carbon to €100 per ton by 2025, and a commitment to end coal-fired power generation in France by 2022. The president also pledged to invest €30 billion in renewable energy and energy efficiency measures, and to launch a national campaign to encourage French citizens to adopt more sustainable lifestyles. Macron's announcement has been welcomed by environmental groups, who have called it a significant step towards reducing France's carbon footprint.",
        "author": "14"},
    {
        "_id": 18,
        "date": "10-15-2022",
        "category": "Medical",
        "viewed": "12346",
        "title": "New Study Finds Link Between Vitamin D Deficiency and Depression",
        "description": "A new study published in the Journal of Affective Disorders has found a strong link between vitamin D deficiency and depression in young adults.",
        "content": "A new study published in the Journal of Affective Disorders has found a strong link between vitamin D deficiency and depression in young adults. The study, which was conducted by researchers at the University of Sydney, analyzed data from over 1,000 participants and found that those with low levels of vitamin D were more likely to experience symptoms of depression. The researchers believe that vitamin D plays a crucial role in brain function and that a deficiency may lead to changes in mood and behavior. They recommend that young adults ensure they are getting enough vitamin D through a combination of diet and exposure to sunlight.",
        "author": "10"},
    {
        "_id": 19,
        "date": "4-1-2023",
        "category": "Medical",
        "viewed": "85232",
        "title": "Study Finds Link Between Air Pollution and Increased Risk of Heart Disease",
        "description": "A new study has found a link between long-term exposure to air pollution and an increased risk of heart disease.",
        "content": "A new study by researchers at the University of Sydney has found a link between long-term exposure to air pollution and an increased risk of heart disease. The study, which analyzed data from over 10,000 participants, found that people living in areas with higher levels of air pollution were more likely to develop heart disease than those living in areas with lower levels of pollution. The researchers say that the findings highlight the need for stronger regulations to reduce air pollution and protect public health.",
        "author": "16"},
    {
        "_id": 20,
        "date": "4-1-2023",
        "category": "Science & Technology",
        "viewed": "35973",
        "title": "Australia Launches New Green Energy Initiative",
        "description": "The Australian government has announced a new initiative to promote the use of green energy and reduce the country's reliance on fossil fuels.",
        "content": "The Australian government has announced a new initiative aimed at promoting the use of green energy and reducing the country's reliance on fossil fuels. The initiative includes funding for research and development of new clean energy technologies, as well as incentives for businesses and individuals to adopt more sustainable practices. The government hopes that the initiative will help to reduce carbon emissions and contribute to global efforts to combat climate change. The announcement has been welcomed by environmental groups, who have long called for stronger action on climate change in Australia.",
        "author": "15"},
    {
        "_id": 21,
        "date": "11-15-2022",
        "category": "Politics",
        "viewed": "58920",
        "title": "Emmanuel Macron Wins Re-election as President of France",
        "description": "Emmanuel Macron has been re-elected as the President of France in a closely contested election.",
        "content": "Emmanuel Macron has won a second term as President of France, defeating his closest rival Marine Le Pen in a closely contested election. Macron secured just over 51% of the vote, with Le Pen receiving just under 49%. Macron campaigned on a platform of economic and social reform, promising to invest in education, healthcare, and infrastructure, while also tackling issues such as climate change and immigration. Le Pen, on the other hand, focused on issues such as national sovereignty, border control, and anti-immigrant sentiment. Despite a strong showing from Le Pen, Macron ultimately prevailed, and will now have the opportunity to continue his reform agenda for another five years.",
        "author": "17"},
    {
        "_id": 22,
        "date": "04-15-23",
        "viewed": "1000",
        "title": "The Best Places to Visit in Europe",
        "description": "Europe is a continent full of history, culture and natural beauty. Here are some of the best places to visit in Europe.",
        "content": "<p>Europe is a continent full of history, culture and natural beauty. Here are some of the best places to visit in Europe:</p><ul><li><img src='https://unsplash.com/photos/4m1VwvOY5XU' alt='Paris, France'></li><li><img src='https://unsplash.com/photos/7JX0-bfiuxQ' alt='Venice, Italy'></li><li><img src='https://unsplash.com/photos/8vJgUPTZJ9M' alt='Athens, Greece'></li><li><img src='https://static.wikia.nocookie.net/oshi_no_ko/images/b/b0/AiHoshino.png/revision/latest?cb=20210820021211' alt='Ai Hoshino | Oshi no Ko Wiki | Fandom'></li></ul>",
        "author": "1",
        "category": "Travel"
    }
]}