{"Authors":[
    {
        "_id": 1,
        "name": "John Smith",
        "username": "",
        "password": "",
        "dob": "3-12-1980",
        "email": "john.smith@email.com",
        "bio": "John Smith is a political journalist with over 10 years of experience covering national and international news. He has worked for several major newspapers and media outlets, including The New York Times, CNN, and NBC News.",
        "expertise": "Politics, International Relations",
        "publication": ["1"]},
    {
        "_id": 2,
        "name": "Sarah Johnson",
        "username": "",
        "password": "",
        "dob": "8-1-1990",
        "email": "sarah.johnson@email.com",
        "bio": "Sarah Johnson is a sports journalist with a passion for football. She has covered major football tournaments across the world, including the World Cup and the UEFA Champions League. She is currently a senior writer at The Guardian.",
        "expertise": "Football, Sports Journalism",
        "publication": ["2"]},
    {
        "_id": 3,
        "name": "Xia Chen",
        "username": "",
        "password": "",
        "dob": "12-10-1985",
        "email": "xia.chen@email.com",
        "bio": "Xia Chen is a technology journalist with over 10 years of experience covering the latest trends in consumer electronics and emerging technologies. She has written for several major publications in China, including Tencent and Sina.",
        "expertise": "Consumer Electronics, Emerging Technologies",
        "publication": ["3"]},
    {
        "_id": 4,
        "name": "Sarah Jones",
        "username": "",
        "password": "",
        "dob": "7-5-1990",
        "email": "sarah.jones@email.com",
        "bio": "Sarah Jones is a sports journalist with a passion for football. She has covered several major tournaments, including the World Cup and the European Championships, and has written for a range of publications, including The Guardian and The Independent.",
        "expertise": "Football, Sports Journalism",
        "publication": ["4"]},
    {
        "_id": 5,
        "name": "Kenji Nakamura",
        "username": "",
        "password": "",
        "dob": "9-20-1985",
        "email": "kenji.nakamura@email.com",
        "bio": "Kenji Nakamura is a technology journalist with a focus on gaming and consumer electronics. He has covered major tech events, including CES and E3, and has written for several leading publications in Japan, including Nikkei and Asahi Shimbun.",
        "expertise": "Gaming, Consumer Electronics",
        "publication": ["5"]},
    {
        "_id": 6,
        "name": "Sarah Lee",
        "username": "",
        "password": "",
        "dob": "11-12-1990",
        "email": "sarah.lee@email.com",
        "bio": "Sarah Lee is a financial journalist with a focus on the Australian economy and business trends. She has worked for several leading media outlets in Australia, including The Sydney Morning Herald and The Australian Financial Review. ",
        "expertise": "Financial Markets, Australian Economy ",
        "publication": ["6"]},
    {
        "_id": 7,
        "name": "James Chen",
        "username": "",
        "password": "",
        "dob": "8-22-1985",
        "email": "james.chen@email.com",
        "bio": "James Chen is a technology journalist with over 10 years of experience covering the latest trends in tech and digital media. He has worked for several major media outlets, including The Guardian, BBC News, and Wired UK.",
        "expertise": "Technology, Digital Media",
        "publication": ["7"]},
    {
        "_id": 8,
        "name": "Yuki Nakamura",
        "username": "",
        "password": "",
        "dob": "6-5-1990",
        "email": "yuki.nakamura@email.com",
        "bio": "Yuki Nakamura is a sports journalist with a passion for covering international sports events. She has covered the Olympics, the World Cup, and other major sports tournaments for several major media outlets, including NHK, Asahi Shimbun, and Nikkei.",
        "expertise": "Sports Journalism, International Sports",
        "publication": ["8", "10"]},
    {
        "_id": 9,
        "name": "Sarah Lee",
        "username": "",
        "password": "",
        "dob": "6-10-1990",
        "email": "sarah.lee357@email.com",
        "bio": "Sarah Lee is a health and science journalist with over 5 years of experience covering the latest research in health and medicine. She has worked for several major media outlets, including ABC News, The Sydney Morning Herald, and The Conversation.",
        "expertise": "Health, Medicine",
        "publication": ["9", "13"]},
    {
        "_id": 10,
        "name": "Emily Wong",
        "username": "",
        "password": "",
        "dob": "6-15-1989",
        "email": "emily.wong@email.com",
        "bio": "Emily Wong is a health journalist with over 5 years of experience covering the latest news and research in the field of health and wellness. She has worked for several major media outlets in Australia, including ABC News and SBS News.",
        "expertise": "Health, Wellness",
        "publication": ["18"]},
    {
        "_id": 11,
        "name": "David Kim",
        "username": "",
        "password": "",
        "dob": "5-1-1987",
        "email": "david.kim@email.com",
        "bio": "David Kim is a transportation journalist with over 7 years of experience covering the latest developments in transportation and urban planning. He has worked for several major media outlets in California, including the Los Angeles Times and the San Francisco Chronicle.",
        "expertise": "Transportation, Urban Planning",
        "publication": ["11"]},
    {
        "_id": 12,
        "name": "Marie Dupont",
        "username": "",
        "password": "",
        "dob": "9-12-1992",
        "email": "marie.dupont@email.com",
        "bio": "Marie Dupont is a travel journalist with a passion for exploring the world's diverse cultures and destinations. She has worked for several major travel publications, including Condé Nast Traveler and Lonely Planet.",
        "expertise": "Travel, Culture",
        "publication": ["12", "14"]},
    {
        "_id": 13,
        "name": "Pierre Dupont",
        "username": "",
        "password": "",
        "dob": "7-12-1980",
        "email": "pierre.dupont@email.com",
        "bio": "Pierre Dupont is a political journalist with over 15 years of experience covering national and international politics. He has worked for several major media outlets in France, including Le Monde and France 24.",
        "expertise": "Politics, International Relations",
        "publication": ["15"]},
    {
        "_id": 14,
        "name": "Marie Leclerc",
        "username": "",
        "password": "",
        "dob": "7-15-1980",
        "email": "marie.leclerc@email.com",
        "bio": "Marie Leclerc is a journalist with over 15 years of experience covering politics, economics, and social issues. She has worked for several major media outlets in France, including Le Monde and France 24.",
        "expertise": "Politics, Economics",
        "publication": ["17"]},
    {
        "_id": 15,
        "name": "Olivia Lee",
        "username": "",
        "password": "",
        "dob": "6-12-1992",
        "email": "olivia.lee@email.com",
        "bio": "Olivia Lee is an environmental journalist with a passion for sustainability and conservation. She has worked for several major media outlets in Australia, including ABC News and The Sydney Morning Herald.",
        "expertise": "Environment, Sustainability, Conservation",
        "publication": ["20"]},
    {
        "_id": 16,
        "name": "Sarah Johnson",
        "username": "",
        "password": "",
        "dob": "10-15-1990",
        "email": "sarah.johnson@email.com",
        "bio": "Sarah Johnson is a health journalist with over 8 years of experience covering the latest news and research in the field of health and medicine. She has worked for several major media outlets in Australia, including ABC News and The Sydney Morning Herald.",
        "expertise": "Health, Medicine",
        "publication": ["19"]},
    {
        "_id": 17,
        "name": "Sophie Dupont",
        "username": "",
        "password": "",
        "dob": "5-12-1980",
        "email": "sophie.dupont@email.com",
        "bio": "Sophie Dupont is a political journalist with over 10 years of experience covering national and international politics. She has worked for several major media outlets in France, including Le Monde and France 24.",
        "expertise": "Politics, International Affairs",
        "publication": ["21"]}
]}